In [2]:
# All necessary imports
import pandas as pd

# B2.1
`read_table` : Read general delimited file into DataFrame.

In [7]:
# use ',' as the delimiter
# uses first row of the text file as the default header
pd.read_table("comma_seperated_with_header.txt",delimiter=",")

      name  age    address gender  pincode
0  tanishq   21  bangalore      M   560010
1      sam   25        usa      M   100100
2    marry   26     london      F   200200

In [9]:
# use ',' as the delimiter
# header=None uses numbering from 0-N as the header
# we could also pass a list of integer as the header number
pd.read_table("comma_seperate_without_header.txt",delimiter=",",header=None)

         0   1          2  3       4
0  tanishq  21  bangalore  M  560010
1      sam  25        usa  M  100100
2    marry  26     london  F  200200

In [11]:
# use ',' as the delimiter
# we pass a list of string as the header in the parameter name
pd.read_table("comma_seperate_without_header.txt",delimiter=",",names=["name","age","address","gender","pincode"])

      name  age    address gender  pincode
0  tanishq   21  bangalore      M   560010
1      sam   25        usa      M   100100
2    marry   26     london      F   200200

In [14]:
# use ' ' as the delimiter
# uses first row of the text file as the default header
pd.read_table("space_spearated_with_header.txt",delimiter=" ")

      name  age    address gender  pincode
0  tanishq   21  bangalore      M   560010
1      sam   25        usa      M   100100
2    marry   26     london      F   200200

In [18]:
# use ' ' as the delimiter
# header=None uses numbering from 0-N as the header
# we could also pass a list of integer as the header number
pd.read_table("space_spearated_without_header.txt",delimiter=" ",header=None)

         0   1          2  3       4
0  tanishq  21  bangalore  M  560010
1      sam  25        usa  M  100100
2    marry  26     london  F  200200

In [19]:
# use ' ' as the delimiter
# we pass a list of string as the header in the parameter name
pd.read_table("space_spearated_without_header.txt",delimiter=" ",names=["name","age","address","gender","pincode"])

      name  age    address gender  pincode
0  tanishq   21  bangalore      M   560010
1      sam   25        usa      M   100100
2    marry   26     london      F   200200

# B2.2 
### sqlite and pandas

### Using sqlite only

In [25]:
import sqlite3

# sql query to create student131 database
query = """
CREATE TABLE student131
(course VARCHAR(20), courseid VARCHAR(20),
MarkObtained REAL, MarkExpected INTEGER
);"""

# Opens a connection to the SQLite database file 
con = sqlite3.connect(':memory:')

# Executes SQL statement
con.execute(query)

# Commit the current transaction
con.commit()

In [26]:
# List of data to insertt into the table
data = [('DataScience', '20CSE421A ', 49, 50),
('Computer Vision', '20CSE422A ', 45, 50),
('Computational Intelligence', '20CSE423A ', 47, 50)]

# query insert into student131 table 
stmt = "INSERT INTO student131 VALUES(?, ?, ?, ?)"

# Repeatedly executes a SQL statement
con.executemany(stmt, data)

# Commit the current transaction
con.commit()

In [27]:
# query all the rows from the table
cursor = con.execute('select * from student131')

# Fetches all rows from the resultset
rows = cursor.fetchall()

# store the fetched data as a pandas dataframe
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

                       course    courseid  MarkObtained  MarkExpected
0                 DataScience  20CSE421A           49.0            50
1             Computer Vision  20CSE422A           45.0            50
2  Computational Intelligence  20CSE423A           47.0            50

### using pandas instead of sqlite

In [43]:
# Opens a connection to the SQLite database file
conn = sqlite3.connect(':memory:')

# column names and records of the table
columns = ["course", "courseid","MarkObtained", "MarkExpected"]
data = [('DataScience', '20CSE421A ', 49, 50),
('Computer Vision', '20CSE422A ', 45, 50),
('Computational Intelligence', '20CSE423A ', 47, 50)]

# create a dataframe using the data
df = pd.DataFrame(data,columns=columns)

# use pandas function to create/write to database
# it creates a new database if it doesnt already exist
# if it exists, we can choose to replace,append or fail
df.to_sql("newstudent131",conn,if_exists="replace")

In [45]:
# read from sqlite using pandas function
pd.read_sql('select * from newstudent131', conn)

   index                      course    courseid  MarkObtained  MarkExpected
0      0                 DataScience  20CSE421A             49            50
1      1             Computer Vision  20CSE422A             45            50
2      2  Computational Intelligence  20CSE423A             47            50

### example: storing data from file in `QB2.1` to sqlite using pandas

In [40]:
conn =  sqlite3.connect(':memory:')
df = pd.read_table("space_spearated_with_header.txt",delimiter=" ")
df.to_sql("students",conn,if_exists="replace")

In [41]:
pd.read_sql('select * from students', conn)

   index     name  age    address gender  pincode
0      0  tanishq   21  bangalore      M   560010
1      1      sam   25        usa      M   100100
2      2    marry   26     london      F   200200